app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-05 22:24:41.588937"], ["updated_at", "2018-11-05 22:24:41.588937"]]
---
  def create
    @student = Student.create(strong_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-05 22:24:41.965411"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(strong_params(:first_name, :last_name))